[
  {
    "id": "4",
    "title": "The Fellowship of the Ring",
    "author": "J.R.R. Tolkien",
    "year": 1954,
    "genre": "Fantasy",
    "description": "The Fellowships of the Ring is the first volume of J.R.R. Tolkien’s epic Lord of the Rings trilogy. It follows Frodo Baggins, a humble hobbit, who inherits the One Ring, a powerful artifact that could bring darkness to Middle-earth. Frodo embarks on a perilous journey to destroy the ring in the fires of Mount Doom. Along the way, he is joined by a diverse fellowship including humans, hobbits, a dwarf, an elf, and the wizard Gandalf. The novel explores themes of friendship, sacrifice, and the struggle between good and evil. Tolkien’s richly detailed world of Middle-earth, its history, and its creatures captivate readers, making this book a cornerstone of modern fantasy literature.",
    "imageUrl": "/uploads/4.png",
    "favorite": true,
    "timestamp": "2025-06-08T00:00:00Z"
  },
  {
    "id": "5",
    "title": "The Two Towers",
    "author": "J.R.R. Tolkien",
    "year": 1956,
    "genre": "Fantasy",
    "description": "The Two Towers is the second volume of the Lord of the Rings trilogy. The fellowship is broken, and the story follows multiple characters on separate journeys. Frodo and Sam continue their dangerous quest to destroy the One Ring, guided by the enigmatic creature Gollum. Meanwhile, Aragorn, Legolas, and Gimli pursue the captive hobbits Merry and Pippin. The novel introduces the kingdom of Rohan and its people, as well as new threats from the forces of Sauron and Saruman. Themes of loyalty, courage, and hope persist as the characters face overwhelming odds. Tolkien’s vivid world-building and thrilling battles make this installment a powerful continuation of the saga.",
    "imageUrl": "/uploads/5.jpeg",
    "timestamp": "2025-06-08T18:19:56.038Z",
    "favorite": false
  },
  {
    "id": "6",
    "title": "The Return of the Kings",
    "author": "J.R.R. Tolkien",
    "year": 1955,
    "genre": "Fantasy",
    "description": "The Return of the King concludes Tolkien’s Lord of the Rings trilogy. The forces of good prepare for a final stand against the dark lord Sauron. Aragorn claims his rightful throne, uniting men and elves for the ultimate battle. Frodo and Sam’s journey to destroy the One Ring reaches its climax amid betrayal, sacrifice, and hope. The novel explores themes of heroism, redemption, and the cost of power. Tolkien’s masterful storytelling brings resolution to the epic struggle for Middle-earth, making this volume a fitting and emotional finale to one of the greatest fantasy stories ever told.",
    "imageUrl": "/uploads/6.png",
    "favorite": false,
    "timestamp": "2025-06-08T00:00:00Z"
  },
  {
    "id": "7",
    "title": "Disborns",
    "author": "Brandon Sanderson",
    "year": 2006,
    "genre": "Fantasy",
    "description": "Mistborn: The Final Empire is the first book in Brandon Sanderson’s Mistborn series. It follows Vin, a street urchin who discovers she has powerful Allomantic abilities—magic fueled by metals. In a world ruled by the immortal Lord Ruler, Vin joins a group of rebels plotting to overthrow the oppressive regime. The book explores themes of trust, power, and rebellion, while delivering a unique magic system and unpredictable plot twists. Sanderson’s intricate world-building, combined with rich characters and intense action, makes this novel a standout in modern fantasy literature.",
    "imageUrl": "/uploads/7.jpeg",
    "timestamp": "2025-06-08T18:20:41.648Z",
    "favorite": false
  },
  {
    "id": "8",
    "title": "The Name of the Wind",
    "author": "Patrick Rothfuss",
    "year": 2007,
    "genre": "Fantasy",
    "description": "The Name of the Wind is the debut novel by Patrick Rothfuss, telling the story of Kvothe, a gifted young man who becomes the most legendary wizard his world has known. Narrated in the first person, Kvothe recounts his childhood, his time at a magical university, and the tragedies that shaped him. The novel blends lyrical prose, deep character development, and a richly constructed fantasy world. Themes include the pursuit of knowledge, the power of storytelling, and the consequences of fame. Rothfuss’s writing style and world-building have won widespread praise, establishing this book as a modern fantasy classic.",
    "imageUrl": "/uploads/8.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "9",
    "title": "A Game of Thrones",
    "author": "George R.R. Martin",
    "year": 1996,
    "genre": "Fantasy",
    "description": "The first book in George R.R. Martin’s epic fantasy series 'A Song of Ice and Fire' introduces a complex world filled with noble houses vying for power in the Seven Kingdoms of Westeros. The story follows multiple characters including the honorable Stark family, the ambitious Lannisters, and the exiled Targaryen heirs. As political intrigue, betrayal, and war unfold, the novel explores themes of power, loyalty, and survival. Martin’s detailed world-building, morally ambiguous characters, and unpredictable plot twists have made this series a defining work in the fantasy genre.",
    "imageUrl": "/uploads/9.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": true
  },
  {
    "id": "10",
    "title": "1985",
    "author": "George Orwell",
    "year": 1949,
    "genre": "Dystopian",
    "description": "George Orwell’s 1984 is a chilling dystopian novel set in a totalitarian future where the Party, led by Big Brother, exercises complete control over society. The protagonist, Winston Smith, struggles with oppression, constant surveillance, and the manipulation of truth. The novel explores themes of censorship, propaganda, and the loss of individual freedom. Orwell’s stark vision of a bleak future warns of the dangers of authoritarianism and remains profoundly relevant in discussions about privacy and government power.",
    "imageUrl": "/uploads/10.jpeg",
    "favorite": false,
    "timestamp": "2025-06-08T18:45:29.781Z"
  },
  {
    "id": "11",
    "title": "The Handmaid’s Tale",
    "author": "Margaret Atwood",
    "year": 1985,
    "genre": "Dystopian",
    "description": "The Handmaid’s Tale by Margaret Atwood depicts a dystopian society called Gilead, where a theocratic regime has stripped women of their rights. The story follows Offred, a woman forced into sexual servitude to bear children for the ruling class. Themes of power, gender oppression, and resistance permeate the novel. Atwood’s compelling narrative and haunting vision challenge readers to consider issues of autonomy and authoritarianism, making the book a landmark feminist and dystopian work.",
    "imageUrl": "/uploads/11.png",
    "timestamp": "2025-06-08T18:35:29.172Z"
  },
  {
    "id": "12",
    "title": "Brave New Worlds",
    "author": "Aldous Huxley",
    "year": 1932,
    "genre": "Dystopian",
    "description": "Aldous Huxley’s Brave New World imagines a future society where humans are genetically engineered and conditioned to maintain social stability. The novel critiques consumerism, loss of individuality, and the use of technology to control populations. Through characters like Bernard Marx and John the Savage, Huxley explores the conflict between freedom and happiness in a tightly controlled world. The book remains a powerful commentary on modern society and technological ethics.",
    "imageUrl": "/uploads/12.jpeg",
    "favorite": false,
    "timestamp": "2025-06-08T18:45:39.756Z"
  },
  {
    "id": "13",
    "title": "The Hunger Games",
    "author": "Suzanne Collins",
    "year": 2008,
    "genre": "Dystopian",
    "description": "The Hunger Games introduces readers to Katniss Everdeen, a teenager living in a dystopian future where children are forced to fight to the death in a televised event. Katniss volunteers to save her sister and enters the deadly arena. The novel explores themes of survival, government control, and resistance. Collins’ fast-paced narrative and complex characters have made the book a modern classic in young adult dystopian fiction.",
    "imageUrl": "/uploads/13.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": true
  },
  {
    "id": "14",
    "title": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "year": 1953,
    "genre": "Dystopian",
    "description": "In Ray Bradbury’s Fahrenheit 451, books are banned and 'firemen' burn any that are found. The protagonist, Guy Montag, begins to question his role in a society that suppresses knowledge and free thought. The novel addresses themes of censorship, conformity, and the power of literature. Bradbury’s powerful prose warns of the dangers of technological distraction and authoritarianism.",
    "imageUrl": "/uploads/14.png",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": true
  },
  {
    "id": "16",
    "title": "The Notebook",
    "author": "Nicholas Sparks",
    "year": 1996,
    "genre": "Romance",
    "description": "The Notebook tells the touching story of Noah and Allie, whose summer romance endures through years of separation and challenges. Told from Noah’s perspective as an elderly man reading their story to Allie, who suffers from memory loss, the novel explores themes of enduring love and memory. Sparks’ heartfelt narrative captures the power of love to overcome obstacles and the bittersweet nature of life’s trials.",
    "imageUrl": "/uploads/16.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "17",
    "title": "Outlander",
    "author": "Diana Gabaldon",
    "year": 1991,
    "genre": "Romance",
    "description": "Outlander follows Claire Randall, a WWII nurse who is mysteriously transported back to 18th-century Scotland. Amidst the Jacobite uprising, Claire struggles to survive and falls in love with Jamie Fraser, a dashing Highland warrior. The novel blends historical fiction, romance, and adventure, exploring themes of love across time, loyalty, and resilience. Gabaldon’s vivid storytelling and richly detailed setting have captivated millions of readers worldwide.",
    "imageUrl": "/uploads/17.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "18",
    "title": "Me Before You",
    "author": "Jojo Moyes",
    "year": 2012,
    "genre": "Romance",
    "description": "Me Before You is a poignant romance about Louisa Clark, a quirky and spirited young woman, who becomes the caregiver for Will Traynor, a wealthy man left paralyzed after an accident. Their unlikely relationship challenges both to rethink their lives, hopes, and what it means to live fully. Moyes explores themes of love, loss, and personal growth with sensitivity and emotional depth, making this novel both heartwarming and thought-provoking.",
    "imageUrl": "/uploads/18.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": true
  },
  {
    "id": "19",
    "title": "The Time Traveler’s Wife",
    "author": "Audrey Niffenegger",
    "year": 2003,
    "genre": "Romance",
    "description": "The Time Traveler’s Wife tells the unconventional love story of Henry, a man with a rare genetic disorder causing him to involuntarily time travel, and Clare, his wife, who endures the challenges of his unpredictable absences. The novel explores themes of love, fate, and loss, weaving a narrative that spans various moments in their lives. Niffenegger's heartfelt storytelling captures the complexities of relationships tested by extraordinary circumstances.",
    "imageUrl": "/uploads/19.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "20",
    "title": "Treasure Island",
    "author": "Robert Louis Stevenson",
    "year": 1883,
    "genre": "Adventure",
    "description": "Treasure Island is a classic adventure novel chronicling young Jim Hawkins’s quest for buried pirate treasure. After discovering a treasure map, Jim embarks on a dangerous sea voyage with a crew that includes the charismatic but treacherous Long John Silver. The novel explores themes of bravery, greed, and loyalty. Stevenson’s gripping storytelling and memorable characters have made this book a timeless tale of adventure and danger on the high seas.",
    "imageUrl": "/uploads/20.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "21",
    "title": "Call of the Wild",
    "author": "Jack London",
    "year": 1903,
    "genre": "Adventure",
    "description": "Call of the Wild tells the story of Buck, a domesticated dog stolen from his comfortable home and sold into the brutal life of an Alaskan sled dog. As Buck adapts to the harsh wilderness, he reconnects with his primal instincts and fights for survival. London explores themes of nature versus civilization, survival, and transformation. The novel is a powerful portrayal of the call of the wild and the struggle for survival in a harsh environment.",
    "imageUrl": "/uploads/21.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "22",
    "title": "Life of Pi",
    "author": "Yann Martel",
    "year": 2001,
    "genre": "Adventure",
    "description": "Life of Pi tells the extraordinary tale of Pi Patel, a young boy stranded on a lifeboat in the Pacific Ocean with a Bengal tiger named Richard Parker. The story explores survival, faith, and the human spirit’s resilience. Martel’s narrative blurs the lines between reality and imagination, offering a profound meditation on storytelling and belief. The novel’s rich symbolism and emotional depth have earned it critical acclaim worldwide.",
    "imageUrl": "/uploads/22.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "23",
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "year": 1937,
    "genre": "Adventure",
    "description": "The Hobbit follows Bilbo Baggins, a reluctant hobbit who embarks on an unexpected journey with a group of dwarves to reclaim their lost kingdom and treasure from the dragon Smaug. Along the way, Bilbo discovers his courage and resourcefulness, encountering trolls, goblins, and elves. Tolkien’s enchanting tale is filled with adventure, humor, and timeless themes of bravery and friendship. The novel serves as a prelude to the Lord of the Rings trilogy and remains beloved by readers of all ages.",
    "imageUrl": "/uploads/23.png",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "24",
    "title": "Around the World in 80 Days",
    "author": "Jules Verne",
    "year": 1873,
    "genre": "Adventure",
    "description": "Around the World in 80 Days follows the adventurous journey of Phileas Fogg, a meticulous English gentleman who wagers he can circumnavigate the globe in just 80 days. Accompanied by his loyal valet Passepartout, Fogg faces numerous obstacles and thrilling escapades as he races against time. Verne’s novel celebrates human ingenuity, determination, and the spirit of adventure, providing an entertaining exploration of the world during the Victorian era.",
    "imageUrl": "/uploads/24.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "25",
    "title": "The Book Thief",
    "author": "Markus Zusak",
    "year": 2005,
    "genre": "Historical fiction",
    "description": "The Book Thief is a poignant historical novel set in Nazi Germany, narrated by Death. It tells the story of Liesel Meminger, a young girl who finds solace in stealing books and sharing them during the horrors of World War II. Through her relationships with her foster family and a Jewish refugee hiding nearby, the novel explores themes of courage, the power of words, and the resilience of the human spirit. Zusak’s lyrical writing and unique perspective create an unforgettable portrayal of life during a dark period in history.",
    "imageUrl": "/uploads/25.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "26",
    "title": "All the Light We Cannot See",
    "author": "Anthony Doerr",
    "year": 2014,
    "genre": "Historical fiction",
    "description": "All the Light We Cannot See follows the parallel stories of Marie-Laure, a blind French girl, and Werner, a German soldier, during World War II. Their lives intersect in occupied France amidst the destruction and moral complexity of war. Doerr’s beautifully crafted narrative explores themes of survival, hope, and the impact of war on individuals. The novel won the Pulitzer Prize for its evocative prose and profound exploration of human resilience in the face of darkness.",
    "imageUrl": "/uploads/26.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "27",
    "title": "Wolf Hall",
    "author": "Hilary Mantel",
    "year": 2009,
    "genre": "Historical fiction",
    "description": "Wolf Hall is a historical novel that tells the story of Thomas Cromwell’s rise to power in the court of King Henry VIII. Mantel offers a vivid and intimate portrayal of political intrigue, ambition, and survival during a turbulent period in English history. The novel explores themes of power, loyalty, and the complexities of human nature. Mantel’s rich storytelling and complex characters earned the book critical acclaim and the Man Booker Prize.",
    "imageUrl": "/uploads/27.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "28",
    "title": "The Nightingale",
    "author": "Kristin Hannah",
    "year": 2015,
    "genre": "Historical fiction",
    "description": "The Nightingale tells the story of two French sisters during World War II who take different paths of resistance against the Nazi occupation. One joins the underground to save lives, while the other struggles to protect her family. Hannah explores themes of bravery, sacrifice, and the strength of women in wartime. The novel’s emotional depth and vivid storytelling have made it a beloved work of historical fiction.",
    "imageUrl": "/uploads/28.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "29",
    "title": "The Pillars of the Earth",
    "author": "Ken Follett",
    "year": 1989,
    "genre": "Historical fiction",
    "description": "The Pillars of the Earth is an epic historical novel set in 12th-century England, focusing on the construction of a cathedral in the fictional town of Kingsbridge. The story weaves together the lives of noblemen, clergy, and commoners, exploring themes of ambition, love, and betrayal. Follett’s detailed historical research and compelling characters create a rich tapestry of medieval life, politics, and architecture.",
    "imageUrl": "/uploads/29.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "30",
    "title": "Siddhartha",
    "author": "Hermann Hesse",
    "year": 1922,
    "genre": "Philosophical fiction",
    "description": "Siddhartha is a philosophical novel exploring the spiritual journey of a man named Siddhartha during the time of the Buddha. Seeking enlightenment, Siddhartha experiences life as a prince, ascetic, and merchant, ultimately discovering that true wisdom comes from within. Hesse’s poetic prose and profound insights into self-discovery, spirituality, and the nature of existence have made this a classic in philosophical literature.",
    "imageUrl": "/uploads/30.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "31",
    "title": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "year": 1866,
    "genre": "Philosophical fiction",
    "description": "Crime and Punishment tells the story of Raskolnikov, a former student in St. Petersburg who commits a murder and grapples with guilt and morality. Dostoevsky explores themes of redemption, conscience, and the psychology of crime. The novel delves deeply into human suffering and the search for meaning, making it a cornerstone of philosophical and psychological literature.",
    "imageUrl": "/uploads/31.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "32",
    "title": "Zen and the Art of Motorcycle Maintenance",
    "author": "Robert M. Pirsig",
    "year": 1974,
    "genre": "Philosophical fiction",
    "description": "This philosophical memoir recounts a motorcycle journey across America, blending personal narrative with reflections on quality, values, and the meaning of life. Pirsig explores the conflict between classical and romantic modes of understanding and advocates for a synthesis of reason and emotion. The book has become a cult classic, offering profound insights into philosophy and the human condition.",
    "imageUrl": "/uploads/32.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "33",
    "title": "The Unbearable Lightness of Being",
    "author": "Milan Kundera",
    "year": 1984,
    "genre": "Philosophical fiction",
    "description": "Set against the backdrop of the Prague Spring, this novel explores themes of love, identity, and existential philosophy through the lives of several interconnected characters. Kundera examines the tension between lightness and weight in life’s choices and relationships. The novel’s blend of narrative, philosophy, and political context has earned it international acclaim.",
    "imageUrl": "/uploads/33.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "34",
    "title": "The Immortal Life of Henrietta Lacks",
    "author": "Rebecca Skloot",
    "year": 2010,
    "genre": "Biography",
    "description": "This compelling biography tells the story of Henrietta Lacks, a poor African-American woman whose cancer cells were taken without her knowledge in 1951 and became one of the most important tools in medicine. Skloot explores themes of ethics, race, and scientific discovery, weaving Henrietta’s family story with the history of medical research. The book raises important questions about consent and the human side of scientific progress.",
    "imageUrl": "/uploads/34.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "35",
    "title": "Dune",
    "author": "Frank Herbert",
    "year": 1965,
    "genre": "Science fiction",
    "description": "Dune is a science fiction masterpiece set on the desert planet Arrakis, the only source of the universe’s most valuable substance, 'spice.' The story follows Paul Atreides, a young noble who becomes embroiled in political intrigue, betrayal, and a destiny that could change the galaxy. Herbert’s novel explores ecology, religion, and power with rich world-building and complex characters, establishing it as a cornerstone of the genre.",
    "imageUrl": "/uploads/35.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "36",
    "title": "Ender’s Game",
    "author": "Orson Scott Card",
    "year": 1985,
    "genre": "Science fiction",
    "description": "Ender’s Game follows Ender Wiggin, a child genius trained in a military school to prepare for an alien invasion. The novel explores themes of leadership, morality, and the costs of war. Card’s gripping narrative and complex characters have made this book a classic in science fiction literature, raising ethical questions about warfare and humanity.",
    "imageUrl": "/uploads/36.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "37",
    "title": "Neuromancer",
    "author": "William Gibson",
    "year": 1984,
    "genre": "Science fiction",
    "description": "Neuromancer is a seminal cyberpunk novel that follows Case, a washed-up computer hacker hired for a final job in a dystopian future dominated by corporations and cyberspace. Gibson’s vision of virtual reality, artificial intelligence, and corporate control has had a profound impact on science fiction and popular culture. The novel explores themes of identity, technology, and consciousness.",
    "imageUrl": "/uploads/37.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "38",
    "title": "The Left Hand of Darkness",
    "author": "Ursula K. Le Guin",
    "year": 1969,
    "genre": "Science fiction",
    "description": "This science fiction novel is set on the planet Gethen, where inhabitants are ambisexual, changing gender during their life cycle. The story follows an envoy from another world who must navigate complex politics and cultural differences. Le Guin explores themes of gender, identity, and friendship, challenging traditional concepts and expanding the possibilities of science fiction storytelling.",
    "imageUrl": "/uploads/38.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "39",
    "title": "Snow Crash",
    "author": "Neal Stephenson",
    "year": 1992,
    "genre": "Science fiction",
    "description": "Snow Crash is a fast-paced cyberpunk novel set in a future America where the internet has evolved into the Metaverse. The protagonist, Hiro Protagonist, is a hacker and pizza delivery driver who uncovers a virtual drug threatening society. Stephenson blends technology, linguistics, and action in a satirical and thrilling narrative that explores the intersection of reality and virtual worlds.",
    "imageUrl": "/uploads/39.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "40",
    "title": "Gone Girl",
    "author": "Gillian Flynn",
    "year": 2012,
    "genre": "Thriller",
    "description": "Gone Girl is a psychological thriller exploring the complex marriage of Nick and Amy Dunne. When Amy disappears on their fifth wedding anniversary, suspicion falls on Nick, but the truth is far more twisted. Flynn’s novel delves into themes of deception, media influence, and the dark side of relationships, with sharp plot twists that keep readers guessing until the end.",
    "imageUrl": "/uploads/40.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "41",
    "title": "The Girl with the Dragon Tattoo",
    "author": "Stieg Larsson",
    "year": 2005,
    "genre": "Thriller",
    "description": "This thriller follows journalist Mikael Blomkvist and hacker Lisbeth Salander as they investigate the disappearance of a wealthy patriarch’s niece. Set in Sweden, the novel explores corruption, family secrets, and justice. Larsson’s gripping storytelling and complex characters have made this a bestseller and the first in the Millennium series.",
    "imageUrl": "/uploads/41.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "42",
    "title": "The Da Vinci Code",
    "author": "Dan Brown",
    "year": 2003,
    "genre": "Thriller",
    "description": "The Da Vinci Code is a fast-paced thriller featuring symbologist Robert Langdon, who uncovers secrets hidden in famous artworks while investigating a murder in Paris. The novel blends art, religion, and conspiracy theories, captivating readers with its puzzles and suspense. Brown’s work sparked widespread interest and controversy, becoming a global bestseller.",
    "imageUrl": "/uploads/42.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "43",
    "title": "Murder on the Orient Express",
    "author": "Agatha Christie",
    "year": 1934,
    "genre": "Mystery",
    "description": "Detective Hercule Poirot investigates a murder on the luxurious Orient Express train. With all passengers as suspects, Poirot must use his keen intellect to solve the case. Christie’s classic mystery novel is known for its clever plot and surprising conclusion, making it one of her most famous works.",
    "imageUrl": "/uploads/43.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "44",
    "title": "In the Woods",
    "author": "Tana French",
    "year": 2007,
    "genre": "Mystery",
    "description": "In the Woods is a psychological mystery following detective Rob Ryan as he investigates the murder of a young girl in Dublin. The case dredges up memories of his own traumatic childhood. French’s novel explores memory, trauma, and identity with atmospheric prose and complex characters, earning critical acclaim.",
    "imageUrl": "/uploads/44.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "45",
    "title": "The Shining",
    "author": "Stephen King",
    "year": 1977,
    "genre": "Horror",
    "description": "The Shining tells the story of Jack Torrance, who becomes caretaker of the isolated Overlook Hotel during winter. As supernatural forces influence Jack, his family faces terrifying events. King’s novel explores themes of madness, isolation, and the supernatural, becoming a classic in horror literature with its chilling atmosphere and psychological depth.",
    "imageUrl": "/uploads/45.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "1",
    "title": "Harry Potter and the Sorcerer’s Stone",
    "author": "J.K. Rowling",
    "year": 1997,
    "genre": "Fantasy",
    "description": "Harry Potter is an orphaned boy living with his cruel aunt and uncle. On his eleventh birthday, he discovers he is a wizard and receives an invitation to attend Hogwarts School of Witchcraft and Wizardry. At Hogwarts, Harry makes new friends, learns magic, and uncovers hidden truths about his past and his parents’ mysterious deaths. Throughout the school year, he faces challenges including dark forces led by the sinister Voldemort, who is believed to be defeated but remains a threat. The novel blends themes of friendship, courage, and the battle between good and evil. Rowling’s imaginative world captivates readers of all ages, introducing a magical universe full of wonder, danger, and discovery. This first book sets the stage for an epic saga as Harry grows and confronts the dark powers threatening the wizarding world.",
    "imageUrl": "/uploads/1.jpg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "2",
    "title": "Harry Potter and the Chamber of Secrets",
    "author": "J.K. Rowling",
    "year": 1998,
    "genre": "Fantasy",
    "description": "In his second year at Hogwarts, Harry Potter faces a new mystery when students are being petrified and fear grips the school. Harry and his friends Ron and Hermione investigate the legend of the Chamber of Secrets, a hidden room said to house a deadly monster. As the attacks continue, Harry discovers his connection to the dark past of the school and the heir of Salazar Slytherin. The novel explores bravery, loyalty, and overcoming fear, while introducing new magical creatures and characters. Rowling’s storytelling keeps readers engaged with suspense and plot twists, expanding the magical world and deepening the series’ themes.",
    "imageUrl": "/uploads/2.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "3",
    "title": "Harry Potter and the Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "year": 1999,
    "genre": "Fantasy",
    "description": "In his third year at Hogwarts, Harry learns that Sirius Black, a dangerous escaped prisoner, is after him. Dementors, terrifying guards from the wizard prison, patrol the school grounds, affecting Harry deeply. With the help of his new Defense Against the Dark Arts teacher, Professor Lupin, Harry learns to defend himself. The story reveals more about Harry’s past and the truth behind Black’s escape, leading to surprising twists. Themes of friendship, trust, and facing fears are central. This entry adds depth and complexity to the series, enriching the magical world and its characters.",
    "imageUrl": "/uploads/3.jpeg",
    "timestamp": "2025-06-08T00:00:00Z",
    "favorite": false
  },
  {
    "id": "46",
    "title": "VFVGFDG",
    "author": "GFDGDFG",
    "year": 1234,
    "genre": "Adventure",
    "description": "FDF",
    "imageUrl": "/uploads/image-1749404207262-201049336.png",
    "favorite": false,
    "timestamp": "2025-06-08T00:00:00Z"
  }
]